{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Devrim Tech Blog",
    "description": "Kai Devrim McCormick is a high school programmer who also has an interest for writing. This is where he comes to write his blog and share his ideas.",
    "home_page_url": "https://devrim.tech",
    "items": [
        {
            "id": "https://devrim.tech/2020/06/22/How-to-escape-tutorial-hell/",
            "url": "https://devrim.tech/2020/06/22/How-to-escape-tutorial-hell/",
            "title": "How to Escape Tutorial Hell",
            "date_published": "2020-06-23T04:56:00.000Z",
            "content_html": "<h3 id=\"Introduction\"><a href=\"#Introduction\" class=\"headerlink\" title=\"Introduction\"></a>Introduction</h3><p>A lot of programmers have been here before, no matter how much experience they have. Tutorial Purgatory or Tutorial Hell as I will be calling it in this blog, sucks precious project time and even learning time out of your career. While I may not have the answer about this topic, I have gathered many other posts about this topic to try and help explain the problem and figure out some answers.</p>\n<h3 id=\"What-is-Tutorial-Hell\"><a href=\"#What-is-Tutorial-Hell\" class=\"headerlink\" title=\"What is Tutorial Hell\"></a>What is Tutorial Hell</h3><p>According to TheJamPearlBlog, “Basically, it is a situation where you find yourself always in the search for a new tutorial, a new book, a new course, a new lesson plan to  build or create something”, what does this mean exactly? Finding new tutorials or other learning resources causes a false sense of understanding in the learner because they will assume that they understand as much as the tutorial they just watched. Usually this is not the case as many people only retain a small amount of information from the content they get, and sometimes they assume that the more time they spend learning, the more time they are getting back to being better. Another thing of note is that according to RandellDawson from FreeCodeCamp, “The problem with tutorials is they lock you into a specific design pattern and you are unable to think for yourself”. Also many people in the community will ask questions similar to this one, “What are some resources or tutorials to learn x”. This one here is a double edged sword because not only does it mean you know some better resources that atleast one person either knows about or tried, but it also means that you are expected to get either a load of resources or a course that over explains your current task. According to MrBenJ on Medium, “This is a great question for anyone that doesn’t know where to start. Just like going for a run, cleaning the dishes, or hitting the gym, sometimes the hardest part is getting started”. His statement is very true and explains exactly why starting is the key to escaping.</p>\n<h3 id=\"How-Do-I-Know-I-am-stuck-in-Tutorial-Hell\"><a href=\"#How-Do-I-Know-I-am-stuck-in-Tutorial-Hell\" class=\"headerlink\" title=\"How Do I Know I am stuck in Tutorial Hell\"></a>How Do I Know I am stuck in Tutorial Hell</h3><p>There are many people who believe that they are just fine and are not stuck in tutorial hell. This assumption can be false and until they check for themselves will continue being stuck under a false idea of their current progress.</p>\n<ul>\n<li></li>\n</ul>\n<hr>\n<p>Sources:<br><a href=\"https://dev.to/davidmm1707/how-to-escape-from-tutorial-hell-and-never-come-back-bb6\" target=\"_blank\" rel=\"noopener\">Dev.to/DavidMM1707</a><br><a href=\"https://medium.com/@MrBenJ/escaping-from-tutorial-hell-c774bbf67d6\" target=\"_blank\" rel=\"noopener\">Medium.com/@MrBenJ</a><br><a href=\"https://www.reddit.com/r/learnprogramming/comments/9f8b7g/stuck_in_tutorial_hell/\" target=\"_blank\" rel=\"noopener\">Reddit.com/r/learnprogramming</a><br><a href=\"https://codeburst.io/digging-my-way-out-of-tutorial-hell-6dd5f9927384\" target=\"_blank\" rel=\"noopener\">Codeburst.io</a><br><a href=\"https://www.freecodecamp.org/forum/t/i-cant-get-out-of-tutorial-hell/333315\" target=\"_blank\" rel=\"noopener\">Freecodecamp.org/RandellDawson</a><br><a href=\"https://thejampearlblog.com/how-to-utilize-tutorials-effectively-and-escape-tutorial-hell/\" target=\"_blank\" rel=\"noopener\">TheJamPearlBlog</a><br><a href=\"https://www.quora.com/Why-is-tutorial-hell-such-a-common-problem-in-the-software-community-especially-for-beginners\" target=\"_blank\" rel=\"noopener\">Quora.com/Why-is-tutorial-hell-a-common-problem</a></p>\n<script>\n        document.querySelectorAll('.github-emoji')\n          .forEach(el => {\n            if (!el.dataset.src) { return; }\n            const img = document.createElement('img');\n            img.style = 'display:none !important;';\n            img.src = el.dataset.src;\n            img.addEventListener('error', () => {\n              img.remove();\n              el.style.color = 'inherit';\n              el.style.backgroundImage = 'none';\n              el.style.background = 'none';\n            });\n            img.addEventListener('load', () => {\n              img.remove();\n            });\n            document.body.appendChild(img);\n          });\n      </script><link rel=\"stylesheet\" href=\"/css/spoiler.css\" type=\"text/css\"><script src=\"/js/spoiler.js\" type=\"text/javascript\" async></script>",
            "tags": []
        },
        {
            "id": "https://devrim.tech/2020/05/17/How-to-make-a-blog-with-Hexo/",
            "url": "https://devrim.tech/2020/05/17/How-to-make-a-blog-with-Hexo/",
            "title": "How to Make a Blog With Hexo",
            "date_published": "2020-05-17T08:48:33.188Z",
            "content_html": "<h6 id=\"Written-by-Kai-McCormick\"><a href=\"#Written-by-Kai-McCormick\" class=\"headerlink\" title=\"Written by Kai McCormick\"></a>Written by Kai McCormick</h6><h2 id=\"What-is-Hexo\"><a href=\"#What-is-Hexo\" class=\"headerlink\" title=\"What is Hexo\"></a>What is Hexo</h2><p><a href=\"https://hexo.io\" target=\"_blank\" rel=\"noopener\">Hexo.io</a> is a blogging framework made by <a href=\"https://github.com/tommy351\" target=\"_blank\" rel=\"noopener\">Tommy Chen</a> in 2012 using Node.js. It has support for plug-ins and themes which allow you to make your blog in any style possible. You start by setting it up in a simple few lines in the CLI and write your post in <a href=\"https://www.markdownguide.org/getting-started\" target=\"_blank\" rel=\"noopener\">markdown</a>. </p>\n<p>In fact this blog was made entirely in Hexo.io. My personal use case for it is that other blog sites might charge either the blog maker or the blog reader. While this might not be the case for some others, Hexo fit my demands the best.</p>\n<h2 id=\"Why-do-I-need-to-use-Hexo\"><a href=\"#Why-do-I-need-to-use-Hexo\" class=\"headerlink\" title=\"Why do I need to use Hexo\"></a>Why do I need to use Hexo</h2><p>You do not need to use Hexo for your blog, you can use Wordpress, Medium, or Tumblr for your blog. But Hexo gives you total control of the blog and is very easy to customize and setup. Also Hexo is 100% free and relies entirely on <a href=\"https://opencollective.com/hexo\" target=\"_blank\" rel=\"noopener\">donations</a> and volunteers. You can also run it on any machine you want, along with it being directly supported by Github Pages and many options for use on your own domain.</p>\n<h2 id=\"How-do-I-install-Hexo\"><a href=\"#How-do-I-install-Hexo\" class=\"headerlink\" title=\"How do I install Hexo\"></a>How do I install Hexo</h2><p>Installing Hexo is as easy as a few lines in your command line. If this is your first time using the command line (don’t be scared as it is very easy to understand how to use it. The first step in installing Hexo is to install npm (node package manager). You will need to install node.js for this but both are very easy to install. You can check if you have these installed by doing <code>npm -v</code> and <code>node -v</code>. If neither of these commands output anything then follow the instructions at the <a href=\"https://nodejs.org/en/\" target=\"_blank\" rel=\"noopener\">npm website</a>. With both of those installed, you just need to run this command, in your terminal. </p>\n<p><code>npm install hexo-cli -g</code></p>\n<p>After running this command, wait until it is finished installing and then run these commands to setup a new folder for you hexo blogs.</p>\n<p><code>hexo init blog</code></p>\n<p><code>cd blog</code></p>\n<p><code>npm install</code></p>\n<p><code>hexo server</code></p>\n<p>Those commands may seem confusing but I will explain. The <code>hexo init blog</code> creates a folder titled blog and puts all of the files needed for a hexo blog inside of it. <code>cd blog</code> is just changing your terminal directory to be within that blog folder. <code>npm install</code> installs all of the needed dependencies for your blog from what is listed in the blog folder. <code>hexo server</code> runs hexo locally on your machine with the default hexo theme and settings.</p>\n<h2 id=\"Setting-up-Hexo\"><a href=\"#Setting-up-Hexo\" class=\"headerlink\" title=\"Setting up Hexo\"></a>Setting up Hexo</h2><p>For this step you will need a text editor, the ones that come built in with your computer will be sufficient. If you look inside of your blog folder, you will see these files:</p>\n<ul>\n<li>_config.yml</li>\n<li>package.json</li>\n<li>scaffolds</li>\n<li>source</li>\n<li>themes</li>\n</ul>\n<p>The <code>config_yml</code> file is the one we will be using. Open it up in your text editor and change it to your liking. You can read more about what each one of these options do and what the default is on the <a href=\"https://hexo.io/docs/configuration\" target=\"_blank\" rel=\"noopener\">hexo website</a>.</p>\n<p>Once finished, with the editing of the settings for your blog, it is time to create your first blog post.</p>\n<h2 id=\"Making-your-first-blog-post\"><a href=\"#Making-your-first-blog-post\" class=\"headerlink\" title=\"Making your first blog post\"></a>Making your first blog post</h2><p>To make a new blog post you need to type some more termianl commands. The first one is to create the blog post file. This is done by running the command <code>hexo new</code> followed by the type of layout and the title. There are three different types of layouts. The layout called draft is for when publishing the blog post, it does not include it until you run a command on it. The layout called post creates a new blog post that will be included when publishing it. The final layout is the page layout that will create a new page for your blog. I reccomend sticking with the draft layout as it is the safest to use. Once you have decided on a layout, run the <code>hexo new</code> command but with the layout after it and a title in quotes. Like the following, <code>hexo new draft \"my-great-blog-post\"</code>. This will make a file in the source folder, open up your .md file with your text editor and start typing up your blog post, since it supports <a href=\"https://www.markdownguide.org/cheat-sheet\" target=\"_blank\" rel=\"noopener\">markdown</a>, it can have style. Once you have finished writing your blog post it is time to wrap it up.</p>\n<h2 id=\"Publishing-your-blog\"><a href=\"#Publishing-your-blog\" class=\"headerlink\" title=\"Publishing your blog\"></a>Publishing your blog</h2><p>Once you have saved your blog post, it needs to be viewed. Hexo makes this very easy to do. If you have selected a draft run the following the command,</p>\n<p><code>hexo publish draft filename</code></p>\n<p>Run the command but replace the filename with the name of your blog post file, usually ending in the .md. To view your blog post locally just the ame server command as before,</p>\n<p><code>hexo server</code></p>\n<p>This will start a local server usually with the link,</p>\n<p><code>http://localhost:4000/</code></p>\n<p>Since this is a local link, only you can see it. To make your files ready for posting, just do</p>\n<p><code>hexo generate</code></p>\n<p>This will make all of your files ready for posting. From here there should be a folder titled public, inside of it all of the files you need to put it on your website.</p>\n<h2 id=\"Conclusion\"><a href=\"#Conclusion\" class=\"headerlink\" title=\"Conclusion\"></a>Conclusion</h2><p>Once you have Hexo setup, making another post is easy as running those same commands. You can trust that this will work because I ran all of the same steps to make this post. Hexo has a great community and offers a lot of different ways to tweak it. This post was only an introduction to the Hexo framework and I hope that you can succeed in your blogs.</p>\n<h6 style=\"color:gray\"> Written by Kai McCormick, Published on January 3rd, 2020 </h6><script>\n        document.querySelectorAll('.github-emoji')\n          .forEach(el => {\n            if (!el.dataset.src) { return; }\n            const img = document.createElement('img');\n            img.style = 'display:none !important;';\n            img.src = el.dataset.src;\n            img.addEventListener('error', () => {\n              img.remove();\n              el.style.color = 'inherit';\n              el.style.backgroundImage = 'none';\n              el.style.background = 'none';\n            });\n            img.addEventListener('load', () => {\n              img.remove();\n            });\n            document.body.appendChild(img);\n          });\n      </script><link rel=\"stylesheet\" href=\"/css/spoiler.css\" type=\"text/css\"><script src=\"/js/spoiler.js\" type=\"text/javascript\" async></script>",
            "tags": [
                "hexo, programming, blog, frameworks, tutorial"
            ]
        }
    ]
}